package crypanalysis

import (
	"fmt"
	"log/slog"
	"testing"
)

func TestFreqAnalysis(t *testing.T) {
	var a FreqCryptAnalysator

	text := `Алиса сидела со старшей сестрой на берегу и маялась: делать ей было совершенно нечего, а сидеть без дела, сами знаете, дело нелегкое; раз-другой она, правда, сунула нос в книгу, которую сестра читала, но там не оказалось ни картинок, ни стишков. «Кому нужны книжки без картинок, – или хоть стишков, не понимаю!» – думала Алиса.

С горя она начала подумывать (правда, сейчас это тоже было дело не из легких – от жары ее совсем разморило), что, конечно, неплохо бы сплести венок из маргариток, но плохо то, что тогда нужно подниматься и идти собирать эти маргаритки, как вдруг... Как вдруг совсем рядом появился белый кролик с розовыми глазками!

Тут, разумеется, еще не было ничего такого необыкновенного; Алиса-то не так уж удивилась, даже когда услыхала, что Кролик сказал (а сказал он: «Ай-ай-ай! Я опаздываю!»). Кстати, потом, вспоминая обо всем этом, она решила, что все-таки немножко удивиться стоило, но сейчас ей казалось, что все идет как надо.

Но когда Кролик достал из жилетного кармана (да-да, именно!) ЧАСЫ (настоящие!) и, едва взглянув на них, опрометью кинулся бежать, тут Алиса так и подскочила!

Еще бы! Ведь это был первый Кролик в жилетке и при часах, какого она встретила за всю свою жизнь!

Сгорая от любопытства, она со всех ног помчалась вдогонку за Кроликом и, честное слово, чуть-чуть его не догнала!

Во всяком случае, она поспела как раз вовремя, чтобы заметить, как Белый Кролик скрылся в большой норе под колючей изгородью.

В ту же секунду Алиса не раздумывая ринулась за ним. А кой о чем подумать ей не мешало бы – ну хоть о том, как она выберется обратно!

Нора сперва шла ровно, как тоннель, а потом сразу обрывалась так круто и неожиданно, что Алиса ахнуть не успела, как полетела-полетела вниз, в какой-то очень, очень глубокий колодец.

То ли колодец был действительно уж очень глубокий, то ли летела Алиса уж очень не спеша, но только вскоре выяснилось, что теперь у нее времени вволю и для того, чтобы осмотреться кругом, и для того, чтобы подумать, что ее ждет впереди.

Первым делом она, понятно, поглядела вниз и попыталась разобрать, куда она летит, но там было слишком темно; тогда она стала рассматривать стены колодца и заметила, что вместо стен шли сплошь шкафы и шкафчики, полочки и полки; кое-где были развешаны картинки и географические карты.

С одной из полок Алиса сумела на лету снять банку, на которой красовалась этикетка: «АПЕЛЬСИНОВОЕ ВАРЕНЬЕ». Банка, увы, была пуста, но, хотя Алиса и была сильно разочарована, она, опасаясь ушибить кого-нибудь, не бросила ее, а ухитрилась опять поставить банку на какую-то полку.

– Да, – сказала себе Алиса, – вот это полетела так полетела! Уж теперь я не заплачу, если полечу с лестницы! Дома скажут: вот молодчина! Может, даже с крыши слечу и не пикну!

(Боюсь, что тут она была даже чересчур права!) И она все летела: вниз, и вниз, и вниз! Неужели это никогда не кончится?

– Интересно, сколько я пролетела? – громко сказала Алиса. – Наверное, я уже где-нибудь около центра Земли! Ну да: как раз тысяч шесть километров или что-то в этом роде...

(Дело в том, что Алиса уже обучалась разным наукам и как раз недавно проходила что-то в этом роде; хотя сейчас был не самый лучший случай блеснуть своими познаниями – ведь, к сожалению, никто ее не слушал, – она всегда была не прочь попрактиковаться.)

– Ну да, расстояние я определила правильно, – продолжала она. – Вот только интересно, на каких же я тогда параллелях и меридианах?

(Как видите, Алиса понятия не имела о том, что такое параллели и меридианы, – ей просто нравилось произносить такие красивые, длинные слова.) Немного отдохнув, она снова начала:

– А вдруг я буду так лететь, лететь и пролечу всю Землю насквозь? Вот было бы здорово! Вылезу – и вдруг окажусь среди этих... которые ходят на головах, вверх ногами! Как они называются? Анти... Антипятки, что ли? [Мы-то с вами, конечно, прекрасно знаем, что тех, кто живет на другой стороне земного шара, называют (во всяком случае, в старину называли) антиподами.]

(На этот раз Алиса в душе обрадовалась, что ее никто не слышит: она сама почувствовала, что слово какое-то не совсем такое.)

– Только мне, пожалуй, там придется спрашивать у прохожих, куда я попала: «Извините, тетя, это Австралия или Новая Зеландия»?

(Вдобавок Алиса попыталась еще вежливо присесть! Представляете? Книксен в воздухе! Вы бы смогли, как вы думаете?)

– Но ведь эта тетя тогда подумает, что я дурочка, совсем ничего не знаю! Нет уж, лучше не буду спрашивать. Сама прочитаю! Там ведь, наверно, где-нибудь написано, какая это страна.

И дальше – вниз, вниз и вниз!

Так как никакого другого занятия у нее не было, Алиса вскоре опять заговорила сама с собой.

– Динка будет сегодня вечером ужасно обо мне скучать! (Диной звали ее кошку.) Хоть бы они не забыли дать ей молочка вовремя!.. Милая моя Диночка, хорошо бы ты была сейчас со мной! Мышек тут, правда, наверное, нет, но ты бы ловила летучих мышей. Не все ли тебе равно, киса? Только вот я не знаю, кушают кошки летучих мышек или нет?

И тут Алиса совсем задремала и только повторяла сквозь сон:

– Скушает кошка летучую мышку? Скушает кошка летучую мышку?

А иногда у нее получалось:

– Скушает мышка летучую мошку?

Не все ли равно, о чем спрашивать, если ответа все равно не получишь, правда?

А потом она заснула по-настоящему, и ей уже стало сниться, что она гуляет с Динкой под ручку и ни с того ни с сего строго говорит ей: «Ну-ка, Дина, признавайся: ты хоть раз ела летучих мышей?»

Как вдруг – трах! бах! – она шлепнулась на кучу хвороста и сухих листьев. На чем полет и закончился.

Алиса ни капельки не ушиблась; она моментально вскочила на ноги и осмотрелась: первым делом она взглянула наверх, но там было совершенно темно; зато впереди снова оказалось нечто вроде тоннеля, и где-то там вдали мелькнула фигура Белого Кролика, который улепетывал во весь дух.

Не теряя времени, Алиса бросилась в погоню. Опять казалось, что она вот-вот догонит его, и опять она успела услышать, как Кролик, сворачивая за угол, вздыхает:

– Ах вы ушки-усики мои! Как я опаздываю! Боже мой!

Но, увы, за поворотом Белый Кролик бесследно исчез, а сама Алиса очутилась в очень странном месте.

Это было низкое, длинное подземелье; своды его слабо освещались рядами висячих ламп. Правда, по всей длине стен шли двери, но, к большому сожалению, все они оказались заперты. Алиса довольно скоро удостоверилась в этом, дважды обойдя все подземелье и по нескольку раз подергав каждую дверь. Она уныло расхаживала взад и вперед, пытаясь придумать, как ей отсюда выбраться, как вдруг наткнулась на маленький стеклянный столик, на котором лежал крохотный золотой ключик.

Алиса очень обрадовалась: она подумала, что это ключ от какой-нибудь из дверей. Но увы! Может быть, замки были слишком большие, а может быть, ключик был слишком маленький, только он никак не хотел открывать ни одной двери. Она добросовестно проверяла одну дверь за другой, и тут-то она впервые заметила штору, спускавшуюся до самого пола, а за ней...

За ней была маленькая дверца – сантиметров тридцать высотой. Алиса вставила золотой ключик в замочную скважину – и, о радость, он как раз подошел!

Алиса отворила дверцу: там был вход в узенький коридор, чуть пошире крысиного лаза. Она встала на коленки, заглянула в отверстие – и ахнула: коридор выходил в такой чудесный сад, каких вы, может быть, и не видывали.

Представляете, как ей захотелось выбраться из этого мрачного подземелья на волю, погулять среди прохладных фонтанов и клумб с яркими цветами?! Но в узкий лаз не прошла бы даже одна Алисина голова. «А если бы и прошла, – подумала бедняжка, – тоже хорошего мало: ведь голова должна быть на плечах! Почему я такая большая и нескладная! Вот если бы я умела вся складываться, как подзорная труба или, еще лучше, как веер, – тогда бы другое дело! Научил бы меня кто-нибудь, я бы сложилась – и все в порядке!»

(Будь вы на месте Алисы, вы бы, пожалуй, тоже решили, что сейчас ничего невозможного нет!) Так или иначе, сидеть перед заветной дверцей было совершенно бесполезно, и Алиса вернулась к стеклянному столику, смутно надеясь, что, может быть, там все-таки найдется другой ключ или, на худой конец, книжка: «УЧИСЬ СКЛАДЫВАТЬСЯ!» Ни того, ни другого она, правда, не нашла, зато обнаружила хорошенький пузырек («Ручаюсь, что раньше его тут не было», – подумала Алиса, к горлышку которого был привязан бумажный ярлык (как на бутылочке с лекарством), а на нем большими буквами было четко напечатано: «ВЫПЕЙ МЕНЯ!»

Конечно, выглядело это очень заманчиво, но Алиса была умная девочка и не спешила откликнуться на любезное приглашение.

– Нет, – сказала она, – я сначала посмотрю, написано тут «Яд!» иди нет.

Она недаром перечитала множество поучительных рассказов про детей, с которыми случались разные неприятности – бедные крошки и погибали в пламени, и доставались на съедение диким зверям, – и все только потому, что они забывали (или не хотели помнить!) советы старших. А ведь, кажется, так просто запомнить, что, например, раскаленной докрасна кочергой можно обжечься, если будешь держать ее в руках слишком долго; что если ОЧЕНЬ глубоко порезать палец ножом, из этого пальца, как правило, пойдет кровь, и так далее и тому подобное.

И уж Алиса-то отлично помнила, что если выпьешь слишком много из бутылки, на которой нарисованы череп и кости и написано «Яд!», то почти наверняка тебе не поздоровится (то есть состояние твоего здоровья может ухудшиться).

Однако на этой бутылочке не было ни черепа, ни костей, ни надписи «Яд!», и Алиса рискнула попробовать ее содержимое.

А так как оно оказалось необыкновенно вкусным (на вкус – точь-в-точь смесь вишневого пирога, омлета, ананаса, жареной индюшки, тянучки и горячих гренков с маслом), она сама не заметила, как пузырек опустел.

– Ой, что же это со мной делается! – сказала Алиса. – Я, наверное, и правда складываюсь, как подзорная труба!

Спорить с этим было трудно: к этому времени в ней осталось всего лишь четверть метра. Алиса так и сияла от радости, уверенная, что она теперь свободно может выйти в чудесный сад. Но все-таки она решила на всякий случай немного подождать и убедиться, что она уже перестала уменьшаться в росте. «А то вдруг я буду делаться все меньше, меньше, как свечка, а потом совсем исчезну! – не без тревоги подумала она. – Вот бы поглядеть, на что я буду тогда походка».

И она попыталась вообразить, на что похоже пламя свечи, когда свеча погасла, но это ей не удалось, – ведь, к счастью, ей этого никогда не приходилось видеть...

Подождав немного и убедившись, что все остается по-прежнему, Алиса побежала было в сад; но – такая незадача! – у самого выхода она вспомнила, что оставила золотой ключик на столе, а подбежав опять к столику, обнаружила, что теперь ей никак до ключа не дотянуться.

И главное, его было так хорошо видно сквозь стекло!

Она попробовала влезть на стол по ножке, но ножки были тоже стеклянные и ужасно скользкие, и как Алиса ни старалась, она вновь и вновь съезжала на пол и, наконец, настаравшись и насъезжавшись до изнеможения, бедняжка села прямо на пол и заплакала.

– Ну вот, еще чего не хватало! – сказала Алиса себе довольно строго. – Слезами горю не поможешь! Советую тебе перестать сию минуту!

Алиса вообще всегда давала себе превосходные советы (хотя слушалась их далеко-далеко не всегда); иногда она закатывала себе такие выговоры, что еле могла удержаться от слез; а как-то раз она, помнится, даже попробовала выдрать себя за уши за то, что сжульничала, играя сама с собой в крокет. Эта выдумщица ужасно любила понарошку быть двумя разными людьми сразу!

«А сейчас это не поможет, – подумала бедная Алиса, – да и не получится! Из меня теперь и одной приличной девочки не выйдет!» Тут она заметила, что под столом лежит ларчик, тоже стеклянный. Алиса открыла его – и там оказался пирожок, на котором изюминками была выложена красивая надпись: «СЪЕШЬ МЕНЯ!»

– Ну и ладно, съем, – сказала Алиса. – Если я от него стану побольше, я смогу достать ключ, а если стану еще меньше, пролезу под дверь. Будь что будет – в сад я все равно заберусь! Больше или меньше? Больше или меньше? – озабоченно повторяла она, откусив кусочек пирожка, и даже положила себе руку на макушку, чтобы следить за своими превращениями.

Как же она удивилась, когда оказалось, что ее размеры не изменились!

Вообще-то обычно так и бывает с тем, кто есть пирожки, но Алиса так уже привыкла ждать одних только сюрпризов и чудес, что она даже немножко расстроилась – почему это вдруг опять все пошло, как обычно!

С горя она принялась за пирожок и довольно скоро покончила с ним.

Ой, все чудесится и чудесится! – закричала Алиса. (Она была в таком изумлении, что ей уже не хватало обыкновенных слов, и она начала придумывать свои.) – Теперь из меня получается не то что подзорная труба, а целый телескоп! Прощайте, пяточки! (Это она взглянула на свои ноги, а они были уже где-то далеко-далеко внизу, того и гляди, совсем пропадут.) Бедные вы мои ножки, кто же теперь будет надевать на вас чулочки и туфли... Я-то уж сама никак не сумею обуваться! Ну это как раз неплохо! С глаз долой – из сердца вон! Раз вы так далеко ушли, заботьтесь о себе сами!.. Нет, – перебила она себя, – не надо с ними ссориться, а то они еще не станут меня слушаться! Я вас все равно буду любить, – крикнула она, – а на елку буду вам всегда дарить новые ботиночки!

И она задумалась над тем, как же это устроить.

«Наверное, придется посылать по почте, – думала она. – Вот там все удивятся! Человек отправляет посылку собственным ногам! Да еще по какому адресу:

АЛИСИН ДОМ ул. Ковровая Дорожка (с доставкой на пол) Госпоже Правой Ноге в собственные руки.

– Господи, какую я чепуху болтаю! – воскликнула Алиса, и тут она здорово стукнулась головой об потолок – ведь что ни говори, в ней стало уже три с лишним метра росту!

Тут она сразу вспомнила про золотой ключик; схватила его и помчалась к выходу в сад.

Бедная Алиса! Даже когда она легла на пол, и то она еле-еле смогла поглядеть на садик одним глазком! И это было все, на что она могла теперь надеяться. О том, чтобы выйти в сад, нечего было и мечтать.

Конечно, тут не оставалось ничего другого, как сесть и зареветь в три ручья!

– Как тебе не стыдно так реветь! – сказала она спустя некоторое время. – Такая большая девица! (Что правда, то правда!) Уймись сию минуту, говорят тебе!

Но слезы и не думали униматься: они лились и лились целыми потоками, и скоро Алиса оказалась в центре солидной лужи. Лужа была глубиной ей по щиколотку и залила чуть ли не половину подземелья.

А она еще не успела хорошенько выплакаться!

Вдруг откуда-то издалека послышался быстрый топоток; Алиса поскорее утерла слезы – должна же она была посмотреть, что там происходит!

Это явился не кто иной, как Белый Кролик. Разодетый в пух и прах, в одной лапке он вдобавок держал большущий веер, в другой – пару лайковых бальных перчаток. Он, видно, очень торопился и на ходу бормотал себе под нос:

– Все бы ничего, но вот Герцогиня, Герцогиня! Она придет в ярость, если я опоздаю! Она именно туда и придет!

Алиса была в таком отчаянии, что готова была просить помощи у кого угодно, так что, когда Кролик подбежал поближе, она робким голоском начала:

– Простите, пожалуйста...

Кролик подскочил как ужаленный, выронив перчатки и веер, отпрянул в сторону и тут же скрылся в темноте.

Веер и перчатки Алиса подобрала и, так как ей было очень жарко, принялась обмахиваться веером.

– Ой-ой-ой, – вздохнула она, – ну что же это сегодня за день такой? Все кувырком! Ведь только вчера все было, как всегда! Ой, а что... а что, если... если вдруг это я сама сегодня стала не такая? Вот это да! Вдруг правда я ночью в кого-нибудь превратилась? Погодите, погодите... Утром, когда я встала, я была еще я иди не я? Ой, по-моему, мне как будто было не по себе... Но если я стала не я, то тогда самое интересное – кто же я теперь такая? Ой-ой-ой! Вот это называется головоломка!

И Алиса тут же принялась ее решать. Она сразу подумала о своих подружках. А вдруг она превратилась в кого-нибудь из них?

– Конечно, жалко, но я не Ада, – вздохнула она. – У нее такие чудные локоны, а у меня волосы совсем не вьются... Но уж я, конечно, и не Мэгги! Я-то столько много всего знаю, а она, бедняжка, такая глупенькая! Да и вообще она – это она, а я – это наоборот я, значит... Ой, у меня, наверное, скоро правда голова сломается! Лучше проверю-ка я, все я знаю, что знаю, или не все. Ну-ка: четырежды пять – двенадцать, четырежды шесть – тринадцать, четырежды семь... Ой, мамочка, я так никогда до двадцати не дойду! Ну и ладно, значит, таблица умножения не считается! Лучше возьмем географию. Лондон – это столица Парижа, а Париж – это столица Рима, а Рим... Нет, по-моему, опять что-то не совсем то! Наверно, я все-таки превратилась в Мэгги. Что же делать? Ага! Прочту с выражением какие-нибудь стишки. Ну хоть эти... «Эти! В школу собирайтесь!»

Она сложила ручки, как примерная ученица, и начала читать вслух, но голос ее звучал совсем как чужой и слова тоже были не совсем знакомые:

– Звери, в школу собирайтесь!
Крокодил пропел давно!
Как вы там ни упирайтесь,
Ни кусайтесь, ни брыкайтесь –
Не поможет все равно!

Громко плачут Зверь и Пташка,
– Караул! – кричит Пчела,
С воем тащится Букашка...
Неужели им так тяжко
Приниматься за дела?

Ну вот! Стихи – и те неправильные! – сказала бедняжка Алиса, и глаза ее снова наполнились слезами.

Многие (особенно паны и мамы), безусловно, догадались, какое стихотворение хотела прочитать Алиса. Ну, а для тех, кто его забыл, (или не знал), вот оно:

Дети, в школу собирайтесь,
Петушок пропел давно!
Попроворней одевайтесь,
Светит солнышко в окно.
Человек, и зверь, и пташка –
Все берутся за дела,
С ношей тащится букашка,
За медком летит пчела.

[Теперь, я надеюсь, всем понятно, почему Алиса так расстроилась: эти стихи гораздо лучше, а главное полезнее тех, которые она прочла.]

– Выходит, я все-таки, наверное, Мэгги; и буду я жить в их противном домишке, игрушек у меня не будет, играть почти что не придется, а только все учить, учить и учить уроки. Ну, если так, если я – Мэгги, я тогда лучше останусь тут! Пусть лучше не приходят и не уговаривают! Я им только скажу: «Нет, вы сперва скажите, кто я буду». Если мне захочется им быть, тогда, так и быть, пойду, а если не захочется – останусь тут... пока не стану кем-нибудь еще... Ой, мамочка, мамочка, – зарыдала вдруг Алиса, – пусть лучше скорее приходят и угова-а-а-а-ривают! Я прямо вся замучилась тут одна!

Тут она нечаянно глянула на свои руки и очень удивилась, обнаружив, что, сама того не замечая, натянула крошечную перчатку Кролика. «Как же это я так сумела! – подумала она. – Ой, наверное, я опять буду маленькая!»

Она вскочила и подбежала к столику, чтобы померить, какая она стала. Вот так так! В ней уже было всего сантиметров шестьдесят, и она продолжала таять прямо на глазах. К счастью, Алиса сразу сообразила, что во всем виноват веер – он по-прежнему был у нее в руках, – и поскорее бросила его в сторону. А то неизвестно, чем бы это кончилось!

– Ай да я! Чуть-чуть не пропала! – сказала Алиса. Она была сильно напугана своим внезапным превращением, но счастлива, что ей удалось уцелеть. – А теперь – в сад!

И она со всех ног помчалась к выходу.

Бедная девочка!

Дверца была по-прежнему на замке, а золотой ключик так и лежал на стеклянном столе.

– Ну уж это я прямо не знаю, что такое, – всхлипнула Алиса. – И еще я стала прямо Дюймовочкой какой-то! Дальше ехать некуда!

И только она это сказала, как ноги у нее поехали, и – плюх! – она оказалась по шейку в воде. В первую минуту, нечаянно хлебнув соленой водицы, она было решила, что упала в море.

– Тогда ничего, я поеду домой в поезде! – обрадовалась она. Дело в том, что Алиса однажды уже побывала на море и твердо усвоила, что туда ездят по железной дороге. При слове «море» ей представлялись ряды купальных кабинок, пляж, где малыши с деревянными лопатками копаются в песочке, затем – крыши, а уж за ними – обязательно железнодорожная станция.

Плавать Алиса умела и довольно скоро догадалась, что на самом деле это не море, а пруд, который получился из тех самых слез, какие она проливала, когда была великаншей трех метров ростом.

– Зачем ты только столько ревела, дурочка! – ругала себя Алиса, тщетно пытаясь доплыть до какого-нибудь берега. – Вот теперь в наказание еще утонешь в собственных слезах! Да нет, этого не может быть, – испугалась она, – это уж ни на что не похоже! Хотя сегодня ведь все ни на что не похоже! Это и называется, по-моему, оказаться в плачевном положении...

От этих печальных размышлений ее отвлек сильный плеск воды. Кто-то бултыхнулся в пруд неподалеку от нее и зашлепал по воде так громко, что сперва она было подумала, что это морж, а то и бегемот, и даже чуточку испугалась, но потом вспомнила, какая она сейчас маленькая, успокоилась («Он меня и не заметит», – подумала она), подплыла поближе и увидела, что это всего-навсего мышка, которая, очевидно, тоже нечаянно попала в этот плачевный пруд и тоже пыталась выбраться на твердую почву.

«Заговорить, что ли, с этой Мышью? Может, она мне чем-нибудь поможет? – подумала Алиса. – А уж говорить-то она, наверное, умеет – что тут такого, сегодня и не то бывало! Заговорю с ней – попытка не пытка». И она заговорила:

– О Мышь!

(Вас, наверное, удивляет, почему Алиса заговорила так странно. Дело в том, что, не знаю, как вам, а ей никогда раньше не приходилось беседовать с мышами, и она даже не знала, как позвать (или назвать) Мышь, чтобы та не обиделась. К счастью, она вспомнила, что ее брат как-то забыл на столе (случайно) старинную грамматику, и она (Алиса) заглянула туда (конечно, уж совершенно случайно) – и представляете, там как раз было написано, как нужно вежливо звать мышь! Да, да! Прямо так и было написано:

Именительный: кто? – Мышь.

Родительный: кого? – Мыши.

Дательный: кому? – Мыши.

А в конце:

Звательный: – О Мышь!

Какие могли быть после этого сомнения?)

– О Мышь! – сказала Алиса. – Может быть, вы знаете, как отсюда выбраться? Я ужасно устала плавать в этом пруду, о Мышь!

Мышь взглянула на нее с любопытством и даже, показалось Алисе, подмигнула ей одним глазком, но ничего не сказала.

«Наверное, она не понимает по-нашему, – подумала Алиса. – А-а, я догадалась: это, наверное, французская мышь. Приплыла сюда с войсками Вильгельма Завоевателя!

(Хотя Алиса, как видите, проявила обширные познания в истории, справедливости ради надо подчеркнуть, что она не слишком ясно представляла себе, когда что случилось.) [Вильгельм Завоеватель высадился со своей дружиной на берегах Альбиона в лето 1066.]

По-французски Алиса знала из всего учебника твердо только первую фразу и решила пустить ее в ход.

Мышь так и подпрыгнула в воде и задрожала всем телом. И не удивительно, ведь Алиса сказала: «Где моя кошка?»

– Ой, простите! – поспешила извиниться Алиса, догадавшись, что огорчила бедную мышку. – Я просто как-то не подумала, что ведь вы не любите кошек.

– «Не любите кошек»! – передразнила Мышь пронзительным голосом. – А ты бы их любила на моем месте?

– Наверное, наверное, нет, – примирительным тоном сказала Алиса. – Вы только не сердитесь! А все-таки я бы хотела познакомить вас с нашей Диночкой! Вот ручаюсь, если вы ее только увидите, вы сразу полюбите кошечек! Она такая ласковая, милая кисонька, – продолжала Алиса вспоминать вслух, не спеша подплывая к Мыши, – и она так приятно мурлычет у камина, и так хорошо умывается – и лапки, и мордочку моет; и она так уютно сидит на руках, и она вся такая мягонькая, пушистая – одно удовольствие, и она так здорово ловит мышей... Ой, простите меня, пожалуйста! – опять закричала Алиса, потому что Мышь вся ощетинилась, и уж тут не приходилось сомневаться, что она возмущена Алисиной бестактностью до глубины души. – Не будем больше о ней говорить, раз вам так неприятно, – смущенно пролепетала Алиса.

– Говорить? – с негодованием пискнула Мышь, задрожав до самого кончика хвоста. – Стала бы я говорить о таком неприличном предмете! Я и слышать об этом не желаю! В нашем семействе всегда терпеть не могли этих подлых, мерзких, вульгарных тварей! И прошу вас – больше ни слова!

– Не буду, не буду, – торопливо уверяла ее Алиса. – А вы... а вы любите... любите... собачек? – нашлась она наконец. Мышь не отвечала. Алиса сочла ее молчание за согласие и с воодушевлением продолжала:

– Вот и хорошо! Как раз около нас живет чудный песик, вот бы вам его показать! Представляете, хорошенький маленький терьер, глазки блестят, а шерстка – просто восторг! Длинная, шоколадная и вся вьется! И он умеет подавать поноску, и служить, и давать лапку, и чего-чего только не умеет, я даже не все помню! Его хозяин говорит, он бы с ним ни за какие тысячи не расстался – такой он умный и столько пользы приносит, он даже всех крыс переловил, не только мы... О господи, – сокрушенно перебила себя Алиса, – какая я бестактная девочка!

Несчастная Мышь тем временем уплывала от своей собеседницы что есть духу – только волны шли кругом.

– Мышенька, милая, хорошая, вернитесь! – умильным голосом закричала Алиса. – Честное-пречестное, больше ни слова не скажу ни про Кы, ни про Сы! Услыхав это обещание, мышь повернула и медленно поплыла обратно; мордочка у нее была довольно бледная («Наверное, очень сердится», – нодумала Алиса).

– Выйдем на сушу, дитя, – сказала Мышь еле слышным, дрожащим голосом, – и я расскажу тебе мою историю. Тогда ты поймешь, почему я ненавижу как Тех, так и Этих.

И в самом деле, давно было пора вылезать из воды: в пруду поднялась настоящая толкотня – столько туда свалилось разных птиц и зверей. Среди них оказались: Утка и Попугай, Стреляный Воробей и Орленок Цып-Цып, и даже вымершая птица Додо, он же Ископаемый Дронт. [Между прочим: ДОДО – так называли иногда (конечно, только очень близкие друзья) самого автора «Алисы». Он немного заикался и произносил свою фамилию так: До-До-Должсон!] И кого там еще только не было!

Алиса поплыла первой; остальные потянулись за ней, и вскоре вся компания вылезла на берег.

`
	data := a.Analyse(text)
	slog.Info("Data", "data", data.Frequencies)
	fmt.Println()
	slog.Info("Data", "data", data.Sorted)
	fmt.Println()
	slog.Info("Data", "data", data.InStupid)
	fmt.Println()
	res := a.Decrypt(text)
	slog.Info("Result", "res", res)
}
